tests/benchmark/artillery.yml
config:
  target: "http://benchmark-server:8080" # Uses environment variables for host and port
  phases:
    - duration: 30
      arrivalRate: 10 # 10 requests per second for 30 seconds

scenarios:
  - flow:
      - get:
          url: "/"
          headers:
            Host: "david.localhost" # Custom Host header
            X-Forwarded-For: "217.1.186.106"
            X-Forwarded-Proto: "https"
      - get:
          url: "/Hello.txt"
          headers:
            Host: "david.localhost" # Custom Host header
            X-Forwarded-For: "217.1.186.106"
            X-Forwarded-Proto: "https"
      - get:
          url: "/style.css"
          headers:
            Host: "david.localhost" # Custom Host header
            X-Forwarded-For: "217.1.186.106"
            X-Forwarded-Proto: "https"
      - get:
          url: "/script.js"
          headers:
            Host: "david.localhost" # Custom Host header
            X-Forwarded-For: "217.1.186.106"
            X-Forwarded-Proto: "https"